[
  {
    "name": "Sue Aldwell",
    "stance": "SUPPORT",
    "reason": "The candidate explicitly supports implementing a 5% GST and discusses how it would contribute to a fairer tax system, indicating a positive stance towards the tax.",
    "url": "https://election2025.gg/candidates/browse/sue-aldwell/"
  },
  {
    "name": "Art Allen",
    "stance": "OPPOSE",
    "reason": "The candidate, Art Allen-O’Leary, explicitly states that he stands against any form of Goods and Services Tax (GST) and will focus on opposing it.",
    "url": "https://election2025.gg/candidates/browse/art-allen-o-leary/"
  },
  {
    "name": "Chris Blin",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states their opposition to GST as a quick fix to fiscal problems and emphasizes the need for government reform and efficiency improvements before considering increased taxation. They prioritize fair and competitive tax policy over implementing GST.",
    "url": "https://election2025.gg/candidates/browse/chris-blin/"
  },
  {
    "name": "Tina Bury",
    "stance": "NEUTRAL",
    "reason": "The candidate does not explicitly support or oppose GST; instead, they acknowledge it as a potential part of a broader tax solution, prioritizing corporate tax reform and closing income tax loopholes first.",
    "url": "https://election2025.gg/candidates/browse/tina-bury/"
  },
  {
    "name": "Andy Cameron",
    "stance": "OPPOSE",
    "reason": "Proposing a commission to find alternatives to GST suggests a desire to replace or significantly alter the current GST system, indicating opposition to the existing tax structure.",
    "url": "https://election2025.gg/candidates/browse/andy-cameron/"
  },
  {
    "name": "Tim Carre",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly opposes the GST and supports the NO GST campaign. They argue against the implementation of GST by emphasizing the need for fairness and protection of vulnerable community members, and they advocate against direct tax increases on essential goods and services.",
    "url": "https://election2025.gg/candidates/browse/tim-carre/"
  },
  {
    "name": "Garry Collins",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states opposition to introducing GST, citing concerns about its impact on the poorest and most vulnerable, and aligns with the Association of Guernsey Charities' stance against GST. They also suggest alternative solutions like changes in corporate tax.",
    "url": "https://election2025.gg/candidates/browse/garry-collins/"
  },
  {
    "name": "Tony Corbin",
    "stance": "OPPOSE",
    "reason": "The statement clearly indicates that Raymond ‘Tony’ Corbin opposes the introduction of a Goods and Services Tax (GST), describing it as unfair and destabilising, and suggests finding alternative solutions to balance the budget.",
    "url": "https://election2025.gg/candidates/browse/tony-corbin/"
  },
  {
    "name": "Rob Curgenven",
    "stance": "OPPOSE",
    "reason": "The candidate, Rob Curgenven, argues against relying on raising the GST to address the fiscal deficit, suggesting alternative methods such as economic growth and efficiency measures instead.",
    "url": "https://election2025.gg/candidates/browse/rob-curgenven/"
  },
  {
    "name": "David De Lisle",
    "stance": "OPPOSE",
    "reason": "The candidate argues against the introduction of GST, citing concerns about the time required to recover implementation costs and the additional burden it would place on residents already facing high living expenses.",
    "url": "https://election2025.gg/candidates/browse/david-de-lisle/"
  },
  {
    "name": "David Dorrity",
    "stance": "SUPPORT",
    "reason": "David Dorrity explicitly supports the GST-plus proposal, viewing it as a fair method to enhance Guernsey's financial future. He highlights its benefits, such as protections for pensioners and lower earners, and stresses the urgency of implementing tax increases, including GST, to avoid future negative consequences.",
    "url": "https://election2025.gg/candidates/browse/david-dorrity/"
  },
  {
    "name": "John Dyke",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly opposes implementing GST, has a history of voting against it multiple times, and believes it should not be approved without addressing spending issues first.",
    "url": "https://election2025.gg/candidates/browse/john-dyke/"
  },
  {
    "name": "Steve Falla",
    "stance": "OPPOSE",
    "reason": "The candidate has never voted for GST and expresses concern about increasing the tax burden on residents, indicating opposition to the implementation of GST without broader tax reform.",
    "url": "https://election2025.gg/candidates/browse/steve-falla/"
  },
  {
    "name": "Adrian Gabriel",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states their opposition to the introduction of a Goods and Services Tax (GST), citing concerns about its impact on lower-income households and potential negative effects on economic growth. They suggest looking for alternative revenue sources and improving the current tax system instead.",
    "url": "https://election2025.gg/candidates/browse/adrian-gabriel/"
  },
  {
    "name": "Kerensa Gardner",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states that GST is an unfair tax and opposes its application to essential items like food and fuel. They advocate for finding alternatives to GST and focus on other means of increasing tax revenue and economic growth.",
    "url": "https://election2025.gg/candidates/browse/kerensa-gardner/"
  },
  {
    "name": "Sally Gilman",
    "stance": "OPPOSE",
    "reason": "The statement clearly indicates that the candidate is against implementing a Goods and Services Tax (GST) and prefers to consider alternative taxation methods.",
    "url": "https://election2025.gg/candidates/browse/sally-gilman/"
  },
  {
    "name": "John Gollop",
    "stance": "NEUTRAL",
    "reason": "The statement does not express a clear overall position on the introduction of GST itself, but rather specifies a condition (exemption for charities) if GST is introduced. This indicates neither support nor opposition to GST as a whole.",
    "url": "https://election2025.gg/candidates/browse/john-gollop/"
  },
  {
    "name": "David Goy",
    "stance": "OPPOSE",
    "reason": "The statement suggests that the candidate is against implementing GST until there is a change in the tax contributions of the wealthiest, indicating opposition to the current consideration of GST.",
    "url": "https://election2025.gg/candidates/browse/david-goy/"
  },
  {
    "name": "Barry Harris",
    "stance": "OPPOSE",
    "reason": "The candidate's aim to reverse the current GST implementation indicates a disagreement with the existing GST policy, suggesting an opposition to it.",
    "url": "https://election2025.gg/candidates/browse/barry-harris/"
  },
  {
    "name": "Sam Haskins",
    "stance": "SUPPORT",
    "reason": "The candidate expresses support for implementing the GST+ package, emphasizing its benefits for 60% of households and the potential drawbacks of delaying its implementation. The conditionality of \"no viable alternative\" suggests a pragmatic approach rather than outright opposition.",
    "url": "https://election2025.gg/candidates/browse/sam-haskins/"
  },
  {
    "name": "Mark Helyar",
    "stance": "SUPPORT",
    "reason": "The candidate expresses support for the GST+ tax proposals, emphasizing the fairness and mitigating elements such as lower income tax rates and protections for pensioners. They acknowledge the necessity of broadening the tax base due to financial challenges, indicating a supportive stance towards the GST+ proposals specifically.",
    "url": "https://election2025.gg/candidates/browse/mark-helyar/"
  },
  {
    "name": "Rosie Henderson",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states opposition to introducing new taxes such as GST and emphasizes focusing on saving money through better management rather than implementing GST.",
    "url": "https://election2025.gg/candidates/browse/rosie-henderson/"
  },
  {
    "name": "Marc Laine",
    "stance": "NEUTRAL",
    "reason": "The candidate does not explicitly support or oppose GST. Instead, they focus on economic growth and fairness to mitigate GST's impact, suggesting a balanced view rather than a clear stance.",
    "url": "https://election2025.gg/candidates/browse/marc-laine/"
  },
  {
    "name": "Christopher Le Tissier",
    "stance": "OPPOSE",
    "reason": "The candidate clearly states their opposition to the introduction of GST, highlighting its negative effects on specific groups like pensioners and advocating for alternative tax measures instead.",
    "url": "https://election2025.gg/candidates/browse/chris-le-tissier/"
  },
  {
    "name": "Marc Leadbeater",
    "stance": "OPPOSE",
    "reason": "Marc Leadbeater clearly opposes the introduction of a Goods & Services Tax (GST), as he believes it would unfairly impact islanders during a cost-of-living crisis. He advocates for reforming corporate taxation and closing tax loopholes as priorities over implementing a GST.",
    "url": "https://election2025.gg/candidates/browse/marc-leadbeater/"
  },
  {
    "name": "Mary Lowe",
    "stance": "SUPPORT",
    "reason": "Mary Lowe explicitly supports the GST Plus Package, highlighting its benefits for low and middle-income earners and the exemptions for essential items. She also expresses willingness to back the package unless a better alternative is presented, indicating her overall supportive stance.",
    "url": "https://election2025.gg/candidates/browse/mary-lowe/"
  },
  {
    "name": "Lexi Lundberg",
    "stance": "OPPOSE",
    "reason": "The statement clearly indicates that Lexi Lundberg is against the introduction of GST, describing it as regressive and pledging to work towards reversing the decision.",
    "url": "https://election2025.gg/candidates/browse/lexi-lundberg/"
  },
  {
    "name": "Munazza Malik",
    "stance": "SUPPORT",
    "reason": "The candidate supports the GST-Plus package, which includes GST as part of a broader tax reform aimed at equity and protection for lower-income individuals. They advocate for adjustments to GST, such as exemptions for charities, rather than opposing GST entirely.",
    "url": "https://election2025.gg/candidates/browse/munazza-malik/"
  },
  {
    "name": "Aidan Matthews",
    "stance": "OPPOSE",
    "reason": "The candidate voted against the GST+ package and expresses concerns about its impact on inflation and price rises. They are open to alternatives and emphasize minimizing GST rates and exempting essentials, indicating opposition to the current GST framework.",
    "url": "https://election2025.gg/candidates/browse/aidan-matthews/"
  },
  {
    "name": "Liam McKenna",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states their strong opposition to the introduction of a Goods and Services Tax (GST), citing concerns about its regressive nature and potential for future increases. They advocate for alternative revenue sources instead.",
    "url": "https://election2025.gg/candidates/browse/liam-mckenna/"
  },
  {
    "name": "Carl Meerveld",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly opposes the introduction of GST, has actively led a campaign against it, and advocates for alternative economic strategies such as developing an offshore wind farm to generate revenue instead of increasing taxes.",
    "url": "https://election2025.gg/candidates/browse/carl-meerveld/"
  },
  {
    "name": "Jeremy Mercer",
    "stance": "OPPOSE",
    "reason": "The statement clearly indicates that the candidate opposes the Goods and Services Tax by explicitly stating \"No GST\" in their key points on economic growth and taxation.",
    "url": "https://election2025.gg/candidates/browse/jeremy-mercer/"
  },
  {
    "name": "Dianne Mitchell",
    "stance": "NEUTRAL",
    "reason": "The candidate does not explicitly support or oppose GST but rather discusses potential alternatives and suggests a mix of measures, indicating a balanced approach without a clear stance on GST itself.",
    "url": "https://election2025.gg/candidates/browse/diane-mitchell/"
  },
  {
    "name": "Nick Moakes",
    "stance": "SUPPORT",
    "reason": "The candidate initially opposed GST due to concerns about its impact on poorer households but ultimately supported GST+ because it included reforms that would benefit lower-income households. They believed it was the best available option and acted in what they perceived as the best interests of Guernsey.",
    "url": "https://election2025.gg/candidates/browse/nick-moakes/"
  },
  {
    "name": "Paul Montague",
    "stance": "NEUTRAL",
    "reason": "The candidate expresses understanding of concerns and highlights the need for public support and a fair tax strategy, but does not explicitly support or oppose the GST+ proposal. They focus on the conditions under which changes should be made rather than taking a definitive stance.",
    "url": "https://election2025.gg/candidates/browse/paul-montague/"
  },
  {
    "name": "Tom Moore",
    "stance": "NEUTRAL",
    "reason": "The candidate acknowledges the GST+ package and its research basis but expresses concerns about its outcomes being projections. They suggest alternative tax options and restructuring before revisiting the GST+ package, indicating neither clear support nor opposition.",
    "url": "https://election2025.gg/candidates/browse/tom-moore/"
  },
  {
    "name": "Charlie Murray-Edwards",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states that they do not support implementing GST in Guernsey and express skepticism about it. They prefer to explore alternative revenue options before considering GST.",
    "url": "https://election2025.gg/candidates/browse/charlie-murray-edwards/"
  },
  {
    "name": "David Nussbaumer",
    "stance": "OPPOSE",
    "reason": "The statement clearly indicates that the candidate opposes the introduction of the Goods and Services Tax (GST).",
    "url": "https://election2025.gg/candidates/browse/david-john-nussbaumer/"
  },
  {
    "name": "Victoria Oliver",
    "stance": "SUPPORT",
    "reason": "The candidate explicitly supports the introduction of a 5% GST as part of a broader tax reform package, viewing it as essential for maintaining Guernsey's competitiveness and financial stability. Although they have reservations about applying GST to food, their overall position is in favor of implementing the GST.",
    "url": "https://election2025.gg/candidates/browse/victoria-oliver/"
  },
  {
    "name": "George Oswald",
    "stance": "NEUTRAL",
    "reason": "The candidate acknowledges the inevitability of a consumption tax like GST but does not explicitly support or oppose it. Instead, they focus on the structure of the tax, advocating for a tiered system to protect those who are financially vulnerable.",
    "url": "https://election2025.gg/candidates/browse/george-oswald/"
  },
  {
    "name": "Charles Parkinson",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states their opposition to the introduction or increase of GST, citing Guernsey's strong financial position and improved fiscal outlook as reasons against adding the tax burden to the public.",
    "url": "https://election2025.gg/candidates/browse/charles-parkinson/"
  },
  {
    "name": "Tom Rylatt",
    "stance": "OPPOSE",
    "reason": "The statement suggests that the candidate prioritizes reforming the tax system to ensure fairness and adequate contributions from businesses and high net worth individuals before considering the implementation of a GST. This implies a reluctance to support GST in its current form or as a priority.",
    "url": "https://election2025.gg/candidates/browse/tom-rylatt/"
  },
  {
    "name": "Steph Shore",
    "stance": "OPPOSE",
    "reason": "The statement indicates that the candidate wants to overturn the current ruling on GST, which suggests opposition to the existing GST framework.",
    "url": ""
  },
  {
    "name": "Nikki Symons",
    "stance": "SUPPORT",
    "reason": "The candidate expresses support for the introduction of GST, albeit reluctantly, indicating a willingness to back the policy. They also highlight the need for further understanding and targeted exemptions, which suggests a conditional or cautious approach rather than outright opposition.",
    "url": "https://election2025.gg/candidates/browse/nikki-symons/"
  },
  {
    "name": "Lee Van Katwyk",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states their opposition to the introduction of GST, suggesting alternative measures such as defining revenue from Pillar Two, broadening the corporate tax base, and potentially raising income tax. They also express concerns about the Revenue Service's capacity to manage a new GST system.",
    "url": "https://election2025.gg/candidates/browse/lee-van-katwyk/"
  },
  {
    "name": "Simon Vermeulen",
    "stance": "OPPOSE",
    "reason": "Simon Vermeulen explicitly states his opposition to GST, arguing that it is not suitable for Guernsey and advocating for alternative tax measures and a comprehensive tax review instead.",
    "url": "https://election2025.gg/candidates/browse/simon-vermeulen/"
  },
  {
    "name": "Steve Williams",
    "stance": "OPPOSE",
    "reason": "The candidate explicitly states they are not in favour of GST, indicating opposition, despite recognizing the need for states to increase income through other means.",
    "url": "https://election2025.gg/candidates/browse/steve-williams/"
  }
]